Masmiseim36/nxpSDK/devices/MKV56F24/mcuxpresso/startup_mkv56f24.cpp
    // Chip Level - MKV56F24
    DMA0_DMA16_IRQHandler,                // 16 : DMA channel 0/16 transfer complete
    DMA1_DMA17_IRQHandler,                // 17 : DMA channel 1/17 transfer complete
    DMA2_DMA18_IRQHandler,                // 18 : DMA channel 2/18 transfer complete
    DMA3_DMA19_IRQHandler,                // 19 : DMA channel 3/19 transfer complete
    DMA4_DMA20_IRQHandler,                // 20 : DMA channel 4/20 transfer complete
    DMA5_DMA21_IRQHandler,                // 21 : DMA channel 5/21 transfer complete
    DMA6_DMA22_IRQHandler,                // 22 : DMA channel 6/22 transfer complete
    DMA7_DMA23_IRQHandler,                // 23 : DMA channel 7/23 transfer complete
    DMA8_DMA24_IRQHandler,                // 24 : DMA channel 8/24 transfer complete
    DMA9_DMA25_IRQHandler,                // 25 : DMA channel 9/25 transfer complete
    DMA10_DMA26_IRQHandler,               // 26 : DMA channel 10/26 transfer complete
    DMA11_DMA27_IRQHandler,               // 27 : DMA channel 11/27 transfer complete
    DMA12_DMA28_IRQHandler,               // 28 : DMA channel 12/28 transfer complete
    DMA13_DMA29_IRQHandler,               // 29 : DMA channel 13/29 transfer complete
    DMA14_DMA30_IRQHandler,               // 30 : DMA channel 14/30 transfer complete
    DMA15_DMA31_IRQHandler,               // 31 : DMA channel 15/31 transfer complete
    DMA_Error_IRQHandler,                 // 32 : DMA error interrupt channels 0-31
    MCM_IRQHandler,                       // 33 : MCM normal interrupt
    FTFE_IRQHandler,                      // 34 : FTFL command complete
    Read_Collision_IRQHandler,            // 35 : FTFL read collision
    PMC_IRQHandler,                       // 36 : PMC controller low-voltage detect, low-voltage warning
    LLWU_IRQHandler,                      // 37 : Low leakage wakeup
    WDOG_EWM_IRQHandler,                  // 38 : Single interrupt vector for  WDOG and EWM
    TRNG0_IRQHandler,                     // 39 : True randon number generator
    I2C0_IRQHandler,                      // 40 : Inter-integrated circuit 0
    I2C1_IRQHandler,                      // 41 : Inter-integrated circuit 1
    SPI0_IRQHandler,                      // 42 : Serial peripheral Interface 0
    SPI1_IRQHandler,                      // 43 : Serial peripheral Interface 1
    UART5_RX_TX_IRQHandler,               // 44 : UART5 receive/transmit interrupt
    UART5_ERR_IRQHandler,                 // 45 : UART5 error interrupt
    Reserved46_IRQHandler,                // 46 : Reserved interrupt
    UART0_RX_TX_IRQHandler,               // 47 : UART0 receive/transmit interrupt
    UART0_ERR_IRQHandler,                 // 48 : UART0 error interrupt
    UART1_RX_TX_IRQHandler,               // 49 : UART1 receive/transmit interrupt
    UART1_ERR_IRQHandler,                 // 50 : UART1 error interrupt
    UART2_RX_TX_IRQHandler,               // 51 : UART2 receive/transmit interrupt
    UART2_ERR_IRQHandler,                 // 52 : UART2 error interrupt
    ADC0_IRQHandler,                      // 53 : Analog-to-digital converter 0
    HSADC_ERR_IRQHandler,                 // 54 : High speed analog-to-digital converter zero cross
    HSADC0_CCA_IRQHandler,                // 55 : High speed analog-to-digital converter 0 submodule A scan complete
    CMP0_IRQHandler,                      // 56 : Comparator 0
    CMP1_IRQHandler,                      // 57 : Comparator 1
    FTM0_IRQHandler,                      // 58 : FlexTimer module 0 fault, overflow and channels interrupt
    FTM1_IRQHandler,                      // 59 : FlexTimer module 1 fault, overflow and channels interrupt
    UART3_RX_TX_IRQHandler,               // 60 : UART3 receive/transmit interrupt
    UART3_ERR_IRQHandler,                 // 61 : UART3 error interrupt
    UART4_RX_TX_IRQHandler,               // 62 : UART4 receive/transmit interrupt
    UART4_ERR_IRQHandler,                 // 63 : UART4 error interrupt
    PIT0_IRQHandler,                      // 64 : Periodic interrupt timer channel 0
    PIT1_IRQHandler,                      // 65 : Periodic interrupt timer channel 1
    PIT2_IRQHandler,                      // 66 : Periodic interrupt timer channel 2
    PIT3_IRQHandler,                      // 67 : Periodic interrupt timer channel 3
    PDB0_IRQHandler,                      // 68 : Programmable delay block 0
    FTM2_IRQHandler,                      // 69 : FlexTimer module 2 fault, overflow and channels interrupt
    XBARA_IRQHandler,                     // 70 : Inter-peripheral crossbar switch A
    PDB1_IRQHandler,                      // 71 : Programmable delay block 1
    DAC0_IRQHandler,                      // 72 : Digital-to-analog converter 0
    MCG_IRQHandler,                       // 73 : Multipurpose clock generator
    LPTMR0_IRQHandler,                    // 74 : Low power timer interrupt
    PORTA_IRQHandler,                     // 75 : Port A interrupt
    PORTB_IRQHandler,                     // 76 : Port B interrupt
    PORTC_IRQHandler,                     // 77 : Port C interrupt
    PORTD_IRQHandler,                     // 78 : Port D interrupt
    PORTE_IRQHandler,                     // 79 : Port E interrupt
    SWI_IRQHandler,                       // 80 : Software interrupt
    SPI2_IRQHandler,                      // 81 : Serial peripheral Interface 2
    ENC_COMPARE_IRQHandler,               // 82 : ENC Compare
    ENC_HOME_IRQHandler,                  // 83 : ENC Home
    ENC_WDOG_SAB_IRQHandler,              // 84 : ENC Wdog/SAB
    ENC_INDEX_IRQHandler,                 // 85 : ENC Index/Roll over/Roll Under
    CMP2_IRQHandler,                      // 86 : Comparator 2
    FTM3_IRQHandler,                      // 87 : FlexTimer module 3 fault, overflow and channels
    Reserved88_IRQHandler,                // 88 : Reserved interrupt
    HSADC0_CCB_IRQHandler,                // 89 : High speed analog-to-digital converter 0 submodule B scan complete
    HSADC1_CCA_IRQHandler,                // 90 : High speed analog-to-digital converter 1 submodule A scan complete
    CAN0_ORed_Message_buffer_IRQHandler,  // 91 : Flex controller area network 0 message buffer
    CAN0_Bus_Off_IRQHandler,              // 92 : Flex controller area network 0 bus off
    CAN0_Error_IRQHandler,                // 93 : Flex controller area network 0 error
    CAN0_Tx_Warning_IRQHandler,           // 94 : Flex controller area network 0 transmit
    CAN0_Rx_Warning_IRQHandler,           // 95 : Flex controller area network 0 receive
    CAN0_Wake_Up_IRQHandler,              // 96 : Flex controller area network 0 wake up
    PWM0_CMP0_IRQHandler,                 // 97 : Pulse width modulator 0 channel 0 compare
    PWM0_RELOAD0_IRQHandler,              // 98 : Pulse width modulator 0 channel 0 reload
    PWM0_CMP1_IRQHandler,                 // 99 : Pulse width modulator 0 channel 1 compare
    PWM0_RELOAD1_IRQHandler,              // 100: Pulse width modulator 0 channel 1 reload
    PWM0_CMP2_IRQHandler,                 // 101: Pulse width modulator 0 channel 2 compare
    PWM0_RELOAD2_IRQHandler,              // 102: Pulse width modulator 0 channel 2 reload
    PWM0_CMP3_IRQHandler,                 // 103: Pulse width modulator 0 channel 3 compare
    PWM0_RELOAD3_IRQHandler,              // 104: Pulse width modulator 0 channel 3 reload
    PWM0_CAP_IRQHandler,                  // 105: Pulse width modulator 0 capture
    PWM0_RERR_IRQHandler,                 // 106: Pulse width modulator 0 reload error
    PWM0_FAULT_IRQHandler,                // 107: Pulse width modulator 0 fault
    CMP3_IRQHandler,                      // 108: Comparator 3
    HSADC1_CCB_IRQHandler,                // 109: High speed analog-to-digital converter 1 submodule B scan complete
    CAN1_ORed_Message_buffer_IRQHandler,  // 110: Flex controller area network 1 message buffer
    CAN1_Bus_Off_IRQHandler,              // 111: Flex controller area network 1 bus off
    CAN1_Error_IRQHandler,                // 112: Flex controller area network 1 error
    CAN1_Tx_Warning_IRQHandler,           // 113: Flex controller area network 1 transmit
    CAN1_Rx_Warning_IRQHandler,           // 114: Flex controller area network 1 receive
    CAN1_Wake_Up_IRQHandler,              // 115: Flex controller area network 1 wake up
    Reserved116_IRQHandler,               // 116: Reserved interrupt
    Reserved117_IRQHandler,               // 117: Reserved interrupt
    Reserved118_IRQHandler,               // 118: Reserved interrupt
    Reserved119_IRQHandler,               // 119: Reserved interrupt
    PWM1_CMP0_IRQHandler,                 // 120: Pulse width modulator 1 channel 0 compare
    PWM1_RELOAD0_IRQHandler,              // 121: Pulse width modulator 1 channel 0 reload
    PWM1_CMP1_IRQHandler,                 // 122: Pulse width modulator 1 channel 1 compare
    PWM1_RELOAD1_IRQHandler,              // 123: Pulse width modulator 1 channel 1 reload
    PWM1_CMP2_IRQHandler,                 // 124: Pulse width modulator 1 channel 2 compare
    PWM1_RELOAD2_IRQHandler,              // 125: Pulse width modulator 1 channel 2 reload
    PWM1_CMP3_IRQHandler,                 // 126: Pulse width modulator 1 channel 3 compare
    PWM1_RELOAD3_IRQHandler,              // 127: Pulse width modulator 1 channel 3 reload
    PWM1_CAP_IRQHandler,                  // 128: Pulse width modulator 1 capture
    PWM1_RERR_IRQHandler,                 // 129: Pulse width modulator 1 reload error
    PWM1_FAULT_IRQHandler,                // 130: Pulse width modulator 1 fault

}; /* End of g_pfnVectors */

//*****************************************************************************
// Functions to carry out the initialization of RW and BSS data sections. These
// are written as separate functions rather than being inlined within the
// ResetISR() function in order to cope with MCUs with multiple banks of
// memory.
//*****************************************************************************
__attribute__ ((section(".after_vectors.init_data")))
void data_init(unsigned int romstart, unsigned int start, unsigned int len) {
    unsigned int *pulDest = (unsigned int*) start;
    unsigned int *pulSrc = (unsigned int*) romstart;
    unsigned int loop;
    for (loop = 0; loop < len; loop = loop + 4)
        *pulDest++ = *pulSrc++;
}

__attribute__ ((section(".after_vectors.init_bss")))
void bss_init(unsigned int start, unsigned int len) {
    unsigned int *pulDest = (unsigned int*) start;
    unsigned int loop;
    for (loop = 0; loop < len; loop = loop + 4)
        *pulDest++ = 0;
}

//*****************************************************************************
// The following symbols are constructs generated by the linker, indicating
// the location of various points in the "Global Section Table". This table is
// created by the linker via the Code Red managed linker script mechanism. It
// contains the load address, execution address and length of each RW data
// section and the execution and length of each BSS (zero initialized) section.
//*****************************************************************************
extern unsigned int __data_section_table;
extern unsigned int __data_section_table_end;
extern unsigned int __bss_section_table;
extern unsigned int __bss_section_table_end;

//*****************************************************************************
// Reset entry point for your code.
// Sets up a simple runtime environment and initializes the C/C++
// library.
//*****************************************************************************
__attribute__ ((section(".after_vectors.reset")))
void ResetISR(void) {

    // Disable interrupts
    __asm volatile ("cpsid i");


#if defined (__USE_CMSIS)
// If __USE_CMSIS defined, then call CMSIS SystemInit code
    SystemInit();

#else
    // Disable Watchdog
    //  Write 0xC520 to watchdog unlock register
    *((volatile unsigned short *)0x4005200E) = 0xC520;
    //  Followed by 0xD928 to complete the unlock
    *((volatile unsigned short *)0x4005200E) = 0xD928;
    // Now disable watchdog via STCTRLH register
    *((volatile unsigned short *)0x40052000) = 0x01D2u;
#endif // (__USE_CMSIS)

    //
    // Copy the data sections from flash to SRAM.
    //
    unsigned int LoadAddr, ExeAddr, SectionLen;
    unsigned int *SectionTableAddr;

